#Задача: «Два числа в сумме» (Two Sum)
#Условие:
#Дан список целых чисел nums и целое число target. Вам нужно вернуть индексы двух чисел в массиве, в сумме дающих заданное число target.

#Уточнения:
#Предполагается, что у каждого набора есть ровно одно решение.
#Вы не можете использовать один и тот же элемент дважды.

nums = [1, 2, 54, 33, 12, 9]

target = 21

for i in range(len(nums)):
    for j in range(i + 1, len(nums)):
        if nums[i] + nums[j] == target:
            print([i, j])
            print(nums[i], nums[j])
            break
        

